package com.company;

public class Main {

    public static void main(String[] args) {

        int a = 5, b = 2,c = 8;
//1)       5 + 2 / 8; //Result: 5// Сначало выполняется деление потом сложение
//2)       (5 + 2) / 8; //Result:0// Сначала выполняется сложение потом деление
//3)       (5 + 2++) / 8 //Result:0// В скобках значение постфиксного инкремента+5,потом делим на 8
//4)       (5 + 2++) / --8//Result:1//Выполняем то что в скобках первым.Потом значение постфиксного инкремента +5
//       Находим зачение префиксного инкремента 8. Делим друг на друга
//5)       (5 * 2 >> 2++) / --8//Result:0//1: (5 * 2 >> 2++) 2: 2++ 3: 5*2 4: >> 5:--8 6: значение в скобках/значение --8
        int d=7,e=20,f=68,h=22;
        boolean g=(5 + 7 > 20);//false
//6)       (5 + 7 > 20 ? 68 : 22 * 2 >> 2++) / --8//Result:1// считаем 22 * 2 >> 2++. 1: 2++ 2:22*2 3:>> 4:--8 5: /
        boolean k=(68>=68);//true
//7)        (5 + 7 > 20 ? 68 => 68 : 22 * 2 >> 2++) / --8 //Result:1// считаем 22 * 2 >> 2++. 1: 2++ 2:22*2 3:>> 4:--8 5: /
        int l=119,m=12,o=3,p=6;
        boolean q=(6-2>3);//true
        boolean n = (12*12)<=119;//false
        boolean s= true&&false;//false//Конъюнкция (и)
//8)         6 - 2 > 3 && 12 * 12 <= 119 //Result:false// 1: 6-2 2: 12*12 3: q 4: n 5: s

//9)      true && false //Result:false// 1:s

}
}
